In [ ]:
print("ok")

In [1]:
people = {
    "first" : ["manash","rahim","sakib"],
    "last" : ["mondal","hasan","rahaman"],
    "email" : ["manash@gmail.com","rahim@yahoo.com","sakib@hotmail.com"]
}

In [2]:
people

{'first': ['manash', 'rahim', 'sakib'],
 'last': ['mondal', 'hasan', 'rahaman'],
 'email': ['manash@gmail.com', 'rahim@yahoo.com', 'sakib@hotmail.com']}

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame(people)

In [ ]:
df

In [ ]:
df['email']

In [ ]:
type(df['email'])

In [ ]:
df.email

In [ ]:
df.columns

In [ ]:
df[['first','email']]

In [ ]:
df.iloc[1]

In [ ]:
df.iloc[0,2] #row and col

In [ ]:
df.iloc[[0,1]]

In [ ]:
df.iloc[[0,2]]

In [ ]:
df.iloc[[0,2],2]

In [ ]:
# loc() uses level to access data
df.loc[[0,1],['email']]

In [ ]:
df.loc[[0,1],['email','first']]

In [ ]:
df.set_index('email')

In [ ]:
df.index

In [ ]:
df.set_index('email',inplace=True)

In [ ]:
df

In [ ]:
df.loc['manash@gmail.com']

In [ ]:
df.reset_index(inplace = True)

In [ ]:
df

In [ ]:
df.reset_index(inplace = True, drop = True)

In [ ]:
df

In [ ]:
df.set_index('first')

In [ ]:
#df.drop(['index'], axis = 1)  #df.drop(['A'], axis = 1)

In [ ]:
df

In [ ]:
df.drop(['index','level_0'], axis = 1)

In [ ]:
df

In [ ]:
df.drop(['index','level_0'], axis = 1,inplace=True)

In [ ]:
df

In [ ]:
df.set_index('first',inplace=True)

In [ ]:
df

In [ ]:
df

In [ ]:
df.set_index('first', inplace=True)

In [ ]:
df

In [ ]:
df.sort_index()

In [ ]:
df.sort_index(ascending=False)

In [ ]:
df

In [ ]:
df['last']=='hasan'   # return sries of row the string "hasan"

In [48]:
df[df['last']=='mondal']

                   email    last
first
manash  manash@gmail.com  mondal

In [66]:
# equivalent to previous line
filt = (df['last']=="mondal")
df[filt]

                   email    last
first
manash  manash@gmail.com  mondal

In [56]:
# equivalent to previous line

df.loc[filt]

                   email    last
first
manash  manash@gmail.com  mondal

In [57]:
df.loc[filt,'email']

first
manash    manash@gmail.com
Name: email, dtype: object

In [73]:
filt1= (df['last']=="rahaman")  & (df['first']=='sakib')
df.loc[filt1]

   first     last              email
2  sakib  rahaman  sakib@hotmail.com

In [74]:
df.loc[~filt1]  # negation of filter

    first    last             email
0  manash  mondal  manash@gmail.com
1   rahim   hasan   rahim@yahoo.com

In [6]:
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [15]:
df.columns = ['first_name','last_name','emails_address']

In [8]:
df

  first_name last_name     emails_address
0     manash    mondal   manash@gmail.com
1      rahim     hasan    rahim@yahoo.com
2      sakib   rahaman  sakib@hotmail.com

In [17]:
df.columns= [x.upper() for x in df.columns]

In [18]:
df

  FIRST_NAME LAST_NAME     EMAILS_ADDRESS
0     manash    mondal   manash@gmail.com
1      rahim     hasan    rahim@yahoo.com
2      sakib   rahaman  sakib@hotmail.com

In [20]:
df.columns = df.columns.str.replace('_','  ')
df

  FIRST NAME LAST NAME     EMAILS ADDRESS
0     manash    mondal   manash@gmail.com
1      rahim     hasan    rahim@yahoo.com
2      sakib   rahaman  sakib@hotmail.com

In [30]:
df.rename(columns= {
    'FIRST NAME': 'first',
    'LAST NAME': 'last'
},inplace=True)
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [31]:
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [32]:
df.loc[1] = ['pritom','mondal','pritom@yahoo.com']
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1  pritom   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [33]:
df.loc[1,'last'] = 'kumar'
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1  pritom    kumar   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [34]:
df.loc[1,'first'] = 'lamda'
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1   lamda    kumar   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [35]:
df.loc[1,['first','last']] = ['pritom','mondal']
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1  pritom   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [37]:
filt = (df['EMAILS ADDRESS'] == 'pritom@yahoo.com')
df.loc[filt,'first'] = 'lamda'
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1   lamda   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [38]:
df['EMAILS ADDRESS'].str.lower()
df

    first     last     EMAILS ADDRESS
0  manash   mondal   manash@gmail.com
1   lamda   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [44]:
df['EMAILS ADDRESS'].str.upper()

KeyError: 'EMAILS ADDRESS'

In [43]:
df.rename(columns= {
    "EMAILS ADDRESS":'email'
},inplace=True)
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   lamda   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [45]:
df['email'].apply(len)

0    16
1    16
2    17
Name: email, dtype: int64

In [46]:
# function uses
def update_first(x):
    return x.upper()
df['first'].apply(update_first)

0    MANASH
1     LAMDA
2     SAKIB
Name: first, dtype: object

In [ ]:
df

In [50]:
# lambda function
df['last'] = df['last'].apply(lambda x:x.upper())
df['last']

0     MONDAL
1     MONDAL
2    RAHAMAN
Name: last, dtype: object

In [51]:
df.apply(len)

first    3
last     3
email    3
dtype: int64

In [52]:
df.apply(len,axis = 'columns')

0    3
1    3
2    3
dtype: int64

In [53]:
df.apply(len,axis = 'rows')

first    3
last     3
email    3
dtype: int64

In [54]:
len(df['email'])

3

In [58]:
df.apply(pd.Series.min)

first               lamda
last               MONDAL
email    manash@gmail.com
dtype: object

In [59]:
df.applymap(len)

   first  last  email
0      6     6     16
1      5     6     16
2      5     7     17

In [60]:
df.applymap(str.upper)

    first     last              email
0  MANASH   MONDAL   MANASH@GMAIL.COM
1   LAMDA   MONDAL   PRITOM@YAHOO.COM
2   SAKIB  RAHAMAN  SAKIB@HOTMAIL.COM

In [61]:
df

    first     last              email
0  manash   MONDAL   manash@gmail.com
1   lamda   MONDAL   pritom@yahoo.com
2   sakib  RAHAMAN  sakib@hotmail.com

In [68]:
df['last'] = df['last'].str.lower()
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   lamda   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [69]:
df1 = pd.DataFrame(people)

In [70]:
df1

    first     last              email
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [72]:
df1['last'].map({
    'mondal':'kumar'
})

0    kumar
1      NaN
2      NaN
Name: last, dtype: object

In [74]:
df['last'].map({
    'mondal':'kumar'
})

0    kumar
1    kumar
2      NaN
Name: last, dtype: object

In [75]:
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   lamda   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [76]:
df['first']+' '+df['last']

0    manash mondal
1     lamda mondal
2    sakib rahaman
dtype: object

In [77]:
df

    first     last              email
0  manash   mondal   manash@gmail.com
1   lamda   mondal   pritom@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [81]:
df['full name']= df['first']+' '+df['last']
df

    first     last              email      full name
0  manash   mondal   manash@gmail.com  manash mondal
1   lamda   mondal   pritom@yahoo.com   lamda mondal
2   sakib  rahaman  sakib@hotmail.com  sakib rahaman

In [82]:
df.drop(columns=['first','last'])

               email      full name
0   manash@gmail.com  manash mondal
1   pritom@yahoo.com   lamda mondal
2  sakib@hotmail.com  sakib rahaman

In [83]:
df

    first     last              email      full name
0  manash   mondal   manash@gmail.com  manash mondal
1   lamda   mondal   pritom@yahoo.com   lamda mondal
2   sakib  rahaman  sakib@hotmail.com  sakib rahaman

In [84]:
df.drop(columns=['first','last'], inplace=True)
df

               email      full name
0   manash@gmail.com  manash mondal
1   pritom@yahoo.com   lamda mondal
2  sakib@hotmail.com  sakib rahaman

In [90]:
df[['first','last']]=df['full name'].str.split(" ",expand=True)

In [91]:
df

               email      full name   first     last
0   manash@gmail.com  manash mondal  manash   mondal
1   pritom@yahoo.com   lamda mondal   lamda   mondal
2  sakib@hotmail.com  sakib rahaman   sakib  rahaman

In [98]:
df.append({
    'first':'Tony'
},ignore_index=True)

               email      full name   first     last
0   manash@gmail.com  manash mondal  manash   mondal
1   pritom@yahoo.com   lamda mondal   lamda   mondal
2  sakib@hotmail.com  sakib rahaman   sakib  rahaman
3                NaN            NaN    Tony      NaN

In [101]:
df

               email      full name   first     last
0   manash@gmail.com  manash mondal  manash   mondal
1   pritom@yahoo.com   lamda mondal   lamda   mondal
2  sakib@hotmail.com  sakib rahaman   sakib  rahaman

In [99]:
df1= pd.DataFrame(people)
df1

    first     last              email
0  manash   mondal   manash@gmail.com
1   rahim    hasan    rahim@yahoo.com
2   sakib  rahaman  sakib@hotmail.com

In [105]:
merge_df = df.append(df1, ignore_index=True, sort=True)
merge_df

               email   first      full name     last
0   manash@gmail.com  manash  manash mondal   mondal
1   pritom@yahoo.com   lamda   lamda mondal   mondal
2  sakib@hotmail.com   sakib  sakib rahaman  rahaman
3   manash@gmail.com  manash            NaN   mondal
4    rahim@yahoo.com   rahim            NaN    hasan
5  sakib@hotmail.com   sakib            NaN  rahaman

In [110]:
merge_df.drop(index=5)

               email   first      full name     last
0   manash@gmail.com  manash  manash mondal   mondal
1   pritom@yahoo.com   lamda   lamda mondal   mondal
2  sakib@hotmail.com   sakib  sakib rahaman  rahaman
3   manash@gmail.com  manash            NaN   mondal
4    rahim@yahoo.com   rahim            NaN    hasan

In [111]:
merge_df

               email   first      full name     last
0   manash@gmail.com  manash  manash mondal   mondal
1   pritom@yahoo.com   lamda   lamda mondal   mondal
2  sakib@hotmail.com   sakib  sakib rahaman  rahaman
3   manash@gmail.com  manash            NaN   mondal
4    rahim@yahoo.com   rahim            NaN    hasan
5  sakib@hotmail.com   sakib            NaN  rahaman

In [116]:
filt = merge_df['first'] == 'sakib'
merge_df[filt].index
merge_df.drop(index = merge_df[filt].index)

              email   first      full name    last
0  manash@gmail.com  manash  manash mondal  mondal
1  pritom@yahoo.com   lamda   lamda mondal  mondal
3  manash@gmail.com  manash            NaN  mondal
4   rahim@yahoo.com   rahim            NaN   hasan

In [117]:
merge_df

               email   first      full name     last
0   manash@gmail.com  manash  manash mondal   mondal
1   pritom@yahoo.com   lamda   lamda mondal   mondal
2  sakib@hotmail.com   sakib  sakib rahaman  rahaman
3   manash@gmail.com  manash            NaN   mondal
4    rahim@yahoo.com   rahim            NaN    hasan
5  sakib@hotmail.com   sakib            NaN  rahaman